public class Main {
    //Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 
    public static void main(String[] args) {
        for (int i = 0; i <= 30; i = i + 3) {
              System.out.print(1000+i + " ");
            }
    }
}